{
    "programmingLanguages": [
        {
            "title": "Javascript",
            "rating": 5,
            "description": "My number 1 go-to for anything frontend or backend. I have grown very comfortable doing backend in Node."
        },
        {
            "title": "Ruby",
            "rating": 4,
            "description": "Ruby is where I really cut my teeth and learned application programming. My programming thought process comes primarily from what I learned doing Ruby."
        },
        {
            "title": "PHP",
            "rating": 4,
            "description": "I learned to program first in PHP. I worked Wordpress for a long time. Dabbled in Drupal, and eventually Laravel a bit."
        },
        {
            "title": "Bash",
            "rating": 4,
            "description": "Probably one of the only scripting languages you ever need to know :P"
        },
        {
            "title": "Python",
            "rating": 4,
            "description": "Have played with Falcon. Actively help maintain some Flask apps."
        },
        {
            "title": "Elixir",
            "rating": 2,
            "description": "Currently learning and very very interested in Elixir"
        },
        {
            "title": "Erlang",
            "rating": 2,
            "description": "Currently learning and very very interested in Erlang"
        }
    ],
    "cloudProviders": [
        {
            "title": "AWS",
            "rating": 5,
            "description": "I use AWS for everything. I stopped using shared hosting and instead went full AWS."
        },
        {
            "title": "Linode",
            "rating": 4,
            "description": "Whenever I need a cheap server with good networking throughput, this is the goto."
        },
        {
            "title": "GCE",
            "rating": 3,
            "description": "Learned some GCE for fun. It's quiet simple to use in comparison to AWS."
        },
        {
            "title": "Digital Ocean",
            "rating": 3,
            "description": "Similar to Linode. Not much of a difference. Not my goto."
        }
    ],
    "devopsSoftware": [
        {
            "title": "Terraform",
            "rating": 5,
            "description": "I barely sign into AWS anymore because of TF. Have grown comfortable creating my own TF modules."
        },
        {
            "title": "Docker",
            "rating": 5,
            "description": "Use it for dev, staging, and production environments. Great in combination with ECS."
        },
        {
            "title": "Jenkins",
            "rating": 4,
            "description": "Irreplaceable automation monolith >:("
        },
        {
            "title": "Gitlab",
            "rating": 5,
            "description": "Run full CI/CD with ECS on Gitlab. Implement pipelines and automated deploys. Also build libraries and maintain automated semantic versioning with Gitlab."
        },
        {
            "title": "Github",
            "rating": 5,
            "description": "A dev without a github is not a dev."
        },
        {
            "title": "Bitbucket",
            "rating": 3,
            "description": "Used it for a bit for private repos before I discovered Gitlab."
        },
        {
            "title": "Kubernetes",
            "rating": 2,
            "description": "Have some minor exposure to it, but have not deep-dived and put the time it deserves to be learned."
        }
    ],
    "frameworks": [
        {
            "title": "Hapijs",
            "rating": 5,
            "description": "Likely hands down the best nodejs server framework out now. Battle tested. Zero dependencies. It has everything."
        },
        {
            "title": "Reactjs",
            "rating": 5,
            "description": "Have built a couple of libraries to use with it. Lots of experience building on it, over 3 years exp."
        },
        {
            "title": "Riotjs",
            "rating": 5,
            "description": "A superbly simple solution to client side templating. Tiny, elegant, small learning curve."
        },
        {
            "title": "Preactjs",
            "rating": 4,
            "description": "ReactJS's not-annoying little brother. It's like 4kb and actually fun to code. Closer to DOM. More predictable vs React."
        },
        {
            "title": "Ruby on Rails",
            "rating": 4,
            "description": "Rails gave me legs in my programming career. I learned MVC, data structures, good conventions, OOP, and other fantastic principles on Rails."
        },
        {
            "title": "Phoenix",
            "rating": 2,
            "description": "My evolution from Rails to Node has brought me here. It is a skill in development."
        },
        {
            "title": "Laravel",
            "rating": 2,
            "description": "Haven't done much except a couple sample apps, and help friends with their laravel projects. Minimal stuff, but it's very Rails-like, which is cool."
        }
    ],
    "databases": [
        {
            "title": "PostgreSQL",
            "rating": 5,
            "description": "My goto when I have a choice of picking database. Why anyone would use anything else is beyond me."
        },
        {
            "title": "MySQL / MariaDB",
            "rating": 5,
            "description": "Have been developing using MySql / Mariadb for over 8 years."
        },
        {
            "title": "SQLite3",
            "rating": 5,
            "description": "The best test database in the world. Great for integration tests in isolated environments (gitlab runners)."
        },
        {
            "title": "MongoDB",
            "rating": 3,
            "description": "Great for quick apps and caching. I am definitely more of an SQL type of guy, but I can appreciate NoSQL."
        }
    ],
    "expertise": [
        {
            "title": "Javascript",
            "rating": 5,
            "description": "Highly proficient"
        },
        {
            "title": "NodeJS",
            "rating": 5,
            "description": "Highly proficient"
        },
        {
            "title": "DOM",
            "rating": 5,
            "description": "Highly proficient"
        },
        {
            "title": "Ruby",
            "rating": 4,
            "description": "Very proficient"
        },
        {
            "title": "PHP",
            "rating": 4,
            "description": "Proficient but rusty"
        },
        {
            "title": "Python",
            "rating": 4,
            "description": "Proficient but not as knowledgleable with its APIs"
        },
        {
            "title": "SH / Bash / ZSH",
            "rating": 4,
            "description": "Find myself in messy rabbit holes building bash CLI tools all the time"
        }
    ],
    "concepts": {
        "OOP": "",
        "Functional Programming": "",
        "OTP": "",
        "MVC": "",
        "State Management": "",
        "Build Tools": "",
        "Server Management": ""
    },
    "experience": [
        {
            "date": "08/2017 - Present",
            "company": "Miami Dev Shop",
            "role": "Cofound / Lead Developer",
            "responsibilities": [
                "Manage a small dev team for client projects",
                "Guide a watered down scrum/agile methodology",
                "Enforce TDD and other dev best practices",
                "Create Gitlab pipelines for deploying client applications",
                "Maintain supporting libraries that facilitate team development",
                "HapiJS server side API development",
                "General technical consultation",
                "Facilitate technical aspects of business analysis",
                "Manage legacy flask / django apps",
                "Manage client GhostJS apps",
                "Manage client AWS infrastructures",
                "Manage terraform modules and devops",
                "System administration",
                "Help clients understand what they need to build and why",
                "Help local bootcamp graduates get their feet wet in the development industry"
            ],
            "pageBreak": true
        },
        {
            "date": "07/2019 - 07/2020",
            "company": "Netography, Inc",
            "role": "Application Developer",
            "responsibilities": [
                "Fullstack React and ExpressJS",
                "Build dashboards for network flow data using Highcharts",
                "Interactive tables using React Table",
                "Nested multi-table, multi-chart subcomponents",
                "Functional React w/ Hooks",
                "Meta programming with Redux and Redux Sagas",
                "Jest tests for React, Redux and Sagas",
                "Manage public Express API that communicates with private Elasticache API"
            ]
        },
        {
            "date": "05/2016 - 03/2019",
            "company": "Global Eagle",
            "role": "Full Stack Developer",
            "responsibilities": [
                "Fullstack using HapiJS",
                "Develop frontend workflows using Gulp, Grunt, Webpack, so developers can use modern javascript features.",
                "Support older browsers",
                "Support legacy jQuery code",
                "Use jQuery as SPA for legacy browser support",
                "Docker deployments using Jenkins",
                "TDD",
                "Agile management using JIRA",
                "Worked on decommissioned Angular 1 project",
                "Working on next level projects using modern frontend tools (react, vue, imba, riot)",
                "Develop internal dev tools, CLI tools, etc."
            ]
        },
        {
            "date": "05/2015 - 05/2016",
            "company": "Event Entertainment Group",
            "role": "Full Stack Developer",
            "responsibilities": [
                "Rebuilt https://miamimusicweek.com from the ground up (infrastructure, backend, and front-end) with a custom",
                "API that supports previously built technologies, a custom admin, using modern web development tools and",
                "libraries, over an AWS infrastructure.",
                "Upgraded and organize development workflow.",
                "Took the lead in research and implementation of technological infrastructure.",
                "Setup development environments for other developers and team members.",
                "Introduced and Implemented code versioning with git.",
                "Introduced and Implemented the use of front-end development tools such as Gulp and SCSS.",
                "Stabilized WordPress applications and environments.",
                "Abstracted WordPress from its norm and create custom plugins for enhanced security and custom functionality.",
                "Setup LAMPs, LEMPs, NGINX, PHP-FPM, RVM Ruby with Rails, and NodeJS stacks.",
                "Created staging and production environments for various apps.",
                "Migrated multiple WordPress sites to an all-in AWS infrastructure.",
                "Manage AWS (Route 53, CloudFront, S3, EC2, IAM, SES, SQS, SNS, RDS, etc).",
                "Lots of MySQL database management and migrations.",
                "Implemented Auto-Scaling and Load Balancing on apps.",
                "Worked on AWS Lambda for basic computational / decoupled services (NodeJS).",
                "Custom work with Leaflet map API and Google Maps API.",
                "Worked with the newer Postgres JSONB data types and created custom queries.",
                "Setup server management functions and deployments using Capistrano"
            ]
        },
        {
            "date": "1/2014 - 5/2015",
            "company": "Freelance",
            "role": "Self Employed",
            "responsibilities": [
                "Create WordPress Plugins and Themes for clients",
                "Worked on a Code Igniter project",
                "Worked a couple Laravel projects",
                "Deploy Wordpress to AWS, WP Engine, and shared hostings",
                "Worked various Ruby on Rails projects",
                "Deploy Rails projects on Heroku, AWS Beanstalk, etc",
                "Use Capistrano for simple server management",
                "Work with Bootstrap / Zurb Foundation",
                "Built my own CSS frameworks",
                "Produce landing pages",
                "Created an angular 1 streaming radio player"
            ]
        },
        {
            "date": "12/2012 - 1/2014",
            "company": "Do You Remember",
            "role": "Frontend Developer",
            "responsibilities": [
                "Front end Ruby on Rails building a social network on the first take of the project.",
                "Websockets chat using Pusher",
                "Consume 3rd party API for chat suggestions (amazon, ebay, wikipedia, etc)",
                "Later converted into a stories publication, for which I created a WordPress app."
            ]
        }
    ]
}